/**
  ******************************************************************************
  * @文件	includes.h
  * @日期	2015-1-26
  * @说明	所有头文件
  ******************************************************************************
  * 北京交通大学-通信1208-赵小铭
  *
  * 说明:	IAR版本:7.20.2.7314
  *      	库文件版本:标准库 V1.3.0
  * 文件缩进:	Tab Size:4
  * 自动缩进:	Body:4
  * 详细说明见Documents中Readme.txt
  ******************************************************************************
  * 功能描述：
  *           
  ******************************************************************************
  */
#pragma once

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"
#include "arm_math.h"

/* BSP -----------------------------------------------------------------------*/
//#include "PS_Driver.h"
//#include "BT.h"
#include "can.h"
#include "timer.h"	  
#include "Sysinit.h"
/* APP -----------------------------------------------------------------------*/
//#include "SendPS.h"
#include "encoder.h"
#include "motor.h"
#include "motorcontrol.h"
#include "speed.h"
//#include "usart.h"
