/**
  ******************************************************************************
  * @文件	Sysinit.h
  * @日期	2015-1-26
  * @说明	系统初始化
  ******************************************************************************
  * 北京交通大学-通信1208-赵小铭
  *
  * 说明:	IAR版本:7.20.2.7314
  *      	库文件版本:标准库 V1.3.0
  * 文件缩进:	Tab Size:4
  * 自动缩进:	Body:4
  * 详细说明见Documents中Readme.txt
  ******************************************************************************
  * 功能描述：
  *           各类系统初始化
  ******************************************************************************
  */
#pragma once
#include "includes.h"





void Struct_Init(void);
void NVIC_Config(void);
void BEEP_Config(void);
void LED_Config(void);